# Задана натуральная степень k. Сформировать случайным образом список 
# коэффициентов (значения от 0 до 100) многочлена и вывести на экран.
# Пример:
# - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0

from random import randint as rnd

k = int(input('Введите натуральную степень: '))
y = ' '
for i in range(-k, 1):
    a = rnd(0, 100)
    if a != 0:
        y += str(a) + '*x^' + str(-i) + ' + '

y = y.replace('x^1 ', 'x ')
y = y.replace('*x^0', '')
y = y.replace(' 1*x', ' x')
y = y[1:-3]
y += ' = 0'

print(y)
